# Вычислить число Пи c заданной точностью d

import math

lis = [(math.pi)]

#d = int(input'Введите точность для числа Pi: ')

print(lis)

i = int(input('input: '))

l = lis[4:i]


print(l)